# ---------------------------------------------------------
# Brewfile
# 使い方: brew bundle
# ---------------------------------------------------------

# --- CLI Tools ---
brew "awscli"
brew "bat"
brew "btop"
brew "coreutils"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "jq"
brew "mise"
brew "node"
brew "starship"
brew "tig"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Casks (GUI Apps) ---
cask "ghostty"

# --- Fonts ---
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# --- VSCode Extensions ---
vscode "anthropic.claude-code"
